Revit 2027 API
gbXMLBuildingOperatingSchedule Enumeration
Note: This API is now obsolete.
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Analysis.HVACLoadBuildingType instead.")]
public enum gbXMLBuildingOperatingSchedule
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Analysis.HVACLoadBuildingType instead.")>
Public Enumeration gbXMLBuildingOperatingSchedule
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Analysis.HVACLoadBuildingType instead.")]
public enum class gbXMLBuildingOperatingSchedule
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Analysis.HVACLoadBuildingType instead.")>]
type gbXMLBuildingOperatingSchedule
Members
Member name | Value | Description
DefaultOperatingSchedule | 0
KindergartenThruTwelveGradeSchool | 7
NoOfOperatingScheduleEnums | 11
TheaterPerformingArts | 9
TwelveHourFiveDayFacility | 6
TwelveHourSevenDayFacility | 4
TwelveHourSixDayFacility | 5
TwentyFourHourHourFiveDayFacility | 3
TwentyFourHourHourSixDayFacility | 2
TwentyFourHourSevenDayFacility | 1
Worship | 10
YearRoundSchool | 8
Remarks
 This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace